Revit 2026 API

# IExportContextOnLight Method

---

This method marks the beginning of export of a light which is enabled for rendering.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
void OnLight(
	LightNode node
)
```
```vb
Sub OnLight (
	node As LightNode
)
```
```cpp
void OnLight(
	LightNode^ node
)
```
```fsharp
abstract OnLight :
        node : LightNode -> unit
```

#### Parameters

node LightNode
     A node describing the light object.

This method is only called for photo-rendering export (a custom exporter that implements IPhotoRenderContext).

#### Reference

IExportContext Interface

Autodesk.Revit.DB Namespace